## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_service_plan.observe_service_plan_flex will be created
  + resource "azurerm_service_plan" "observe_service_plan_flex" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "centralus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "observeServicePlanSecured-179969258044centralus-6c351029"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "gh-rg-nikhil-flex-plan-pvt-endpoint"
      + sku_name                     = "FC1"
      + worker_count                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>